# Ultralytics YOLO26 crowd detection model with GEFPN + MCS + RFEM
# Based on yolo26-p2.yaml with crowd-specific improvements

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26-crowd backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2RFEM, [512, True]]      # 6 RFEM enhanced
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2RFEM, [1024, True]]     # 8 RFEM enhanced
  - [-1, 1, SPPF, [1024, 5, 3, True]]   # 9
  - [-1, 1, MCS, [1024]]                # 10 MCS multi-scale channel split
  - [-1, 2, C2PSA, [1024]]              # 11

# YOLO26-crowd head with GEFPN cross-scale connections
head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat backbone P3
  - [-1, 2, C3k2, [256, True]]                   # 17 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 2], 1, Concat, [1]]                    # 19 cat backbone P2
  - [-1, 2, C3k2, [128, True]]                   # 20 (P2/4)

  # PANet bottom-up
  - [-1, 1, Conv, [128, 3, 2]]                   # 21
  - [[-1, 17], 1, Concat, [1]]                   # 22 cat head P3
  - [-1, 2, C3k2, [256, True]]                   # 23 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                   # 24
  # GEFPN: backbone P2 (layer 2) cross-skip to P4
  - [2, 1, Conv, [256, 3, 4]]                    # 25 GEFPN P2->P4 downsample (stride=4)
  - [[-1, 24, 14], 1, Concat, [1]]               # 26 cat GEFPN_P2 + P3_down + P4_fpn
  - [-1, 2, C3k2, [512, True]]                   # 27 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                   # 28
  # GEFPN: backbone P3 (layer 4) cross-skip to P5
  - [4, 1, Conv, [512, 3, 4]]                    # 29 GEFPN P3->P5 downsample (stride=4)
  - [[-1, 28, 11], 1, Concat, [1]]               # 30 cat GEFPN_P3 + P4_down + C2PSA
  - [-1, 1, C3k2, [1024, True, 0.5, True]]       # 31 (P5/32)

  - [[20, 23, 27, 31], 1, Detect, [nc]]          # 32 Detect(P2, P3, P4, P5)
